CSI API ETABS v1
cPropFrame.GetDblAngle_2 Method
 Retrieves frame section property data for a double angle-type frame section.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDblAngle_2(
	string Name,
	ref string FileName,
	ref string MatProp,
	ref double T3,
	ref double T2,
	ref double Tf,
	ref double Tw,
	ref double Dis,
	ref double FilletRadius,
	ref bool MirrorAbout3,
	ref int Color,
	ref string Notes,
	ref string GUID
)
Function GetDblAngle_2 (
	Name As String,
	ByRef FileName As String,
	ByRef MatProp As String,
	ByRef T3 As Double,
	ByRef T2 As Double,
	ByRef Tf As Double,
	ByRef Tw As Double,
	ByRef Dis As Double,
	ByRef FilletRadius As Double,
	ByRef MirrorAbout3 As Boolean,
	ByRef Color As Integer,
	ByRef Notes As String,
	ByRef GUID As String
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim FileName As String
Dim MatProp As String
Dim T3 As Double
Dim T2 As Double
Dim Tf As Double
Dim Tw As Double
Dim Dis As Double
Dim FilletRadius As Double
Dim MirrorAbout3 As Boolean
Dim Color As Integer
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.GetDblAngle_2(Name,
	FileName, MatProp, T3, T2, Tf, Tw, Dis,
	FilletRadius, MirrorAbout3, Color,
	Notes, GUID)
int GetDblAngle_2(
	String^ Name,
	String^% FileName,
	String^% MatProp,
	double% T3,
	double% T2,
	double% Tf,
	double% Tw,
	double% Dis,
	double% FilletRadius,
	bool% MirrorAbout3,
	int% Color,
	String^% Notes,
	String^% GUID
)
abstract GetDblAngle_2 :
        Name : string *
        FileName : string byref *
        MatProp : string byref *
        T3 : float byref *
        T2 : float byref *
        Tf : float byref *
        Tw : float byref *
        Dis : float byref *
        FilletRadius : float byref *
        MirrorAbout3 : bool byref *
        Color : int byref *
        Notes : string byref *
        GUID : string byref -> int
Parameters
Name
Type: System.String
The name of an existing frame section property.
FileName
Type: System.String
If the section property was imported from a property file, this is the name of that file. If the section property was not imported, this item is blank.
MatProp
Type: System.String
The name of the material property for the section.
T3
Type: System.Double
The vertical leg depth. [L]
T2
Type: System.Double
The horizontal leg width. [L]
Tf
Type: System.Double
The horizontal leg thickness. [L]
Tw
Type: System.Double
The vertical leg thickness. [L]
Dis
Type: System.Double
The back-to-back distance between the angles. [L]
FilletRadius
Type: System.Double
The fillet radius. [L]
MirrorAbout3
Type: System.Boolean
Indicates whether the section is mirrored about the local 3-axis.
Color
Type: System.Int32
The display color assigned to the section. If Color is specified as -1, the program will automatically assign a color.
Notes
Type: System.String
The notes, if any, assigned to the section.
GUID
Type: System.String
The GUID (global unique identifier), if any, assigned to the section.
Return Value
Type: Int32
returns zero if the section property data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer
       Dim FileName As String
       Dim MatProp As String
       Dim t3 As Double
       Dim t2 As Double
       Dim tf As Double
       Dim tw As Double
       Dim dis As Double
       Dim Radius As Double
       Dim Mirror3 As Boolean
       Dim Color As Integer
       Dim Notes As String
       Dim GUID As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set new frame section property
       ret = SapModel.PropFrame.SetDblAngle_2("DBL_ANGLE1", "A992Fy50", 8, 6, 0.5, 0.5, 0.2, 0.2)
   'get frame section property data
       ret = SapModel.PropFrame.GetDblAngle_2("DBL_ANGLE1", FileName, MatProp, t3, t2, tf, tw, dis, Radius, Mirror3, Color, Notes, GUID)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace